app/Controllers/AdminProductsController.php

INSERT INTO `product_images` (`product_id`, `image_url`) VALUES ('7', 'media/products/1741249867_b570337f08fc60c5808c.jpeg')
---
    public function uploadGallery($productId)
    {
        $images = $this->request->getFiles();

        if ($images && isset($images['file'])) {
            foreach ($images['file'] as $image) {
                if ($image->isValid() && !$image->hasMoved()) {
                    $newName = $image->getRandomName();
                    $image->move('assets/media/products', $newName);

                    $this->productImageModel->insert([
                        'product_id' => $productId,
                        'image_url'  => 'media/products/' . $newName,
                    ]);