app/Controllers/CatalogController.php

SELECT `master_products`.*, `master_brands`.`brand_name`, `master_sizes`.`size_name`
FROM `master_products`
LEFT JOIN `master_brands` ON `master_products`.`product_brand` = `master_brands`.`brand_id`
LEFT JOIN `master_sizes` ON `master_products`.`product_size` = `master_sizes`.`size_id`
SELECT `image_url`
FROM `product_images`
WHERE `product_id` = '1'
---
    public function index()
    {
        $products = $this->productModel
            ->select('master_products.*, master_brands.brand_name,master_sizes.size_name')
            ->join('master_brands', 'master_products.product_brand = master_brands.brand_id', 'left')
            ->join('master_sizes', 'master_products.product_size = master_sizes.size_id', 'left')
            ->findAll();

        foreach ($products as &$product) {
            $product['images'] = $this->productImageModel
                ->where('product_id', $product['product_id'])
                ->findColumn('image_url') ?? [];