app/Controllers/ProductsController.php

SELECT `master_products`.*, `master_brands`.`brand_name`, `master_sizes`.`size_name`
FROM `master_products`
LEFT JOIN `master_brands` ON `master_products`.`product_brand` = `master_brands`.`brand_id`
LEFT JOIN `master_sizes` ON `master_products`.`product_size` = `master_sizes`.`size_id`
WHERE `product_code` = 'BB-3249'
 LIMIT 1
SELECT `image_url`
FROM `product_images`
WHERE `product_id` = '8'
---
    public function show($code = null)
    {
        $product = $this->productModel
        ->select('master_products.*, master_brands.brand_name,master_sizes.size_name')
        ->join('master_brands', 'master_products.product_brand = master_brands.brand_id', 'left')
            ->join('master_sizes', 'master_products.product_size = master_sizes.size_id', 'left')
            ->where('product_code', $code)->first();
        if (!$product) {
            return redirect()->to('/products')->with('error', 'Produk tidak ditemukan.');
        }

        $product['images'] = $this->productImageModel
            ->where('product_id', $product['product_id'])
            ->findColumn('image_url') ?? [];